glcloud/keil_v5/ARM/PACK/.Web/NXP.MK22F12_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <vendor>NXP</vendor>
  <name>MK22F12_DFP</name>
  <description>Device Family Pack for MK22F12</description>
  <license>Licenses.txt</license>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <releases>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Device Startup</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK22F12" Dvendor="NXP:11">
      <description>Kinetis(r) K22 MCUs have been optimized for cost-sensitive applications requiring low power flexibility and processing efficiency.

- Delivers industry-leading low power while providing significant bill-of-materials savings through smart on-chip integration
- Includes options that support crystal-less USB design for reduced system cost and board space
- Provides scalability with various levels of integration, offering a rich suite of analog, communication, timing and control peripherals to accommodate a wide range of requirements
- Shares the comprehensive enablement and scalability of the Kinetis portfolio</description>
      <device Dname="MK22FN1M0xxx12">
        <processor Dcore="Cortex-M4" Dfpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK22FN1M0xxx12_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x100000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fff0000" size="0x010000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x010000"/>
        <algorithm name="arm/MK_P1M0.FLM" start="0x00000000" size="0x00100000" default="1"/>
        <debug svd="MK22F12.xml"/>
        <variant Dvariant="MK22FN1M0VLH12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN1M0VLH12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN1M0VLH12/MK22FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN1M0VLK12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN1M0VLK12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN1M0VLK12/MK22FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN1M0VLL12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN1M0VLL12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN1M0VLL12/MK22FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN1M0VLQ12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN1M0VLQ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN1M0VLQ12/MK22FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN1M0VMC12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN1M0VMC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN1M0VMC12/MK22FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FN1M0VMD12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FN1M0VMD12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FN1M0VMD12/MK22FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK22FX512xxx12">
        <processor Dcore="Cortex-M4" Dfpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK22FX512xxx12_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" access="rx" start="0x10000000" size="0x020000"/>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fff0000" size="0x010000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x010000"/>
        <algorithm name="arm/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000" default="1"/>
        <algorithm name="arm/MK_P512X.FLM" start="0x00000000" size="0x00080000" default="1"/>
        <debug svd="MK22F12.xml"/>
        <variant Dvariant="MK22FX512VLH12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FX512VLH12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FX512VLH12/MK22FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FX512VLK12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FX512VLK12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FX512VLK12/MK22FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FX512VLL12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FX512VLL12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FX512VLL12/MK22FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FX512VLQ12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FX512VLQ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FX512VLQ12/MK22FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FX512VMC12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FX512VMC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FX512VMC12/MK22FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK22FX512VMD12">
          <compile header="fsl_device_registers.h" define="CPU_MK22FX512VMD12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK22FX512VMD12/MK22FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="MK22FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK22FX512???12" Dvendor="NXP:11"/>
    </condition>
    <condition id="devices.MK22F12_device.MK22F12_device.MK22F12_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.port_driver.smc_driver.uart_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
